## Plan output

```
module.application.data.aws_lambda_functions.all: Reading...
module.bastion.data.aws_ami.bastion: Reading...
module.logging.data.aws_lambda_functions.all: Reading...
module.backend.data.aws_partition.current: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.application.module.dashboard.data.aws_caller_identity.identity: Reading...
module.application.module.service.data.aws_region.current: Reading...
module.application.module.secrets.data.aws_partition.current: Reading...
module.application.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.application.module.database.module.database.data.aws_partition.current: Reading...
module.backend.data.aws_caller_identity.identity: Reading...
module.application.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.data.aws_partition.current: Reading...
module.application.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.application.module.dashboard.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.worker.data.aws_caller_identity.identity: Reading...
module.application.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.application.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.application.module.database.data.aws_region.current: Reading...
module.application.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.application.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.bastion.data.aws_partition.current: Reading...
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.dashboard.data.aws_region.current: Reading...
module.application.module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.service.data.aws_partition.current: Reading...
module.application.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_availability_zones.available: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.application.module.worker.data.aws_partition.current: Reading...
module.application.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.application.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.application.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.application.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.application.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.application.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z056235726NAHLFZ5UGDD]
module.application.module.database.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_region.current: Reading...
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.application.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_caller_identity.identity: Reading...
module.application.module.secrets.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.application.module.secrets.data.aws_caller_identity.identity: Read complete after 1s [id=891377151751]
module.logging.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_caller_identity.identity: Reading...
module.bastion.data.aws_ami.bastion: Read complete after 1s [id=ami-0150ccaf51ab55a51]
module.application.module.dashboard.data.aws_partition.current: Reading...
module.application.module.service.data.aws_caller_identity.identity: Reading...
module.application.module.dashboard.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.data.aws_rds_engine_version.this: Reading...
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.application.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.application.module.worker.data.aws_region.current: Reading...
module.application.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.application.module.secrets.data.aws_region.current: Reading...
module.application.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 1s [id=o-f5mr0gq6lc]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.bastion.data.aws_region.current: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.application.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.application.data.aws_lambda_function.datadog["this"]: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=705826187]
module.application.module.database.data.aws_rds_engine_version.this: Read complete after 0s [id=17.5]
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=2124188810]
module.application.module.dashboard.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.worker.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.module.service.data.aws_ssm_parameter.version["/illinois-getchildcare/qa/version"]: Read complete after 0s [id=/illinois-getchildcare/qa/version]
module.application.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.application.module.dashboard.data.aws_vpc.current: Reading...
module.application.module.service.data.aws_vpc.current: Reading...
module.application.module.worker.data.aws_vpc.current: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=90403638]
module.application.module.service.data.aws_vpc.current: Read complete after 1s [id=vpc-0d4fbd78717d772f7]
module.application.module.worker.data.aws_vpc.current: Read complete after 1s [id=vpc-0d4fbd78717d772f7]
module.application.module.dashboard.data.aws_vpc.current: Read complete after 1s [id=vpc-0d4fbd78717d772f7]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.application.module.dashboard.aws_cloudwatch_log_group.service will be created
  + resource "aws_cloudwatch_log_group" "service" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:us-east-1:891377151751:key/28bc802f-0618-4546-864f-6d07b29c1f1a"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/illinois-getchildcare/qa/dashboard"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "service" = "application-worker"
        }
      + tags_all          = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
    }

  # module.application.module.dashboard.aws_iam_policy.execution will be created
  + resource "aws_iam_policy" "execution" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "dashboard task execution policy for illinois-getchildcare qa."
      + id               = (known after apply)
      + name             = "illinois-getchildcare-qa-dashboard-execution"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECRAuthToken"
                    },
                  + {
                      + Action   = [
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-east-1:891377151751:repository/illinois-getchildcare-qa-app"
                      + Sid      = "ECRRepositoryAccess"
                    },
                  + {
                      + Action    = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/environment" = "qa"
                              + "aws:RequestTag/project"     = "illinois-getchildcare"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "LogWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "service" = "application-worker"
        }
      + tags_all         = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
    }

  # module.application.module.dashboard.aws_iam_policy.secrets will be created
  + resource "aws_iam_policy" "secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow acceess to dashboard secrets for illinois-getchildcare qa."
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "illinois-getchildcare-qa-dashboard-secrets-access-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "service" = "application-worker"
        }
      + tags_all         = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
    }

  # module.application.module.dashboard.aws_iam_role.execution will be created
  + resource "aws_iam_role" "execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "dashboard task execution role for illinois-getchildcare qa."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "illinois-getchildcare-qa-dashboard-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "service" = "application-worker"
        }
      + tags_all              = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.application.module.dashboard.aws_iam_role.task will be created
  + resource "aws_iam_role" "task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "dashboard task role for illinois-getchildcare qa."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "illinois-getchildcare-qa-dashboard-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "service" = "application-worker"
        }
      + tags_all              = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.application.module.dashboard.aws_iam_role_policy_attachments_exclusive.execution will be created
  + resource "aws_iam_role_policy_attachments_exclusive" "execution" {
      + policy_arns = [
          + "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
          + (known after apply),
        ]
      + role_name   = "illinois-getchildcare-qa-dashboard-execution"
    }

  # module.application.module.dashboard.aws_iam_role_policy_attachments_exclusive.task will be created
  + resource "aws_iam_role_policy_attachments_exclusive" "task" {
      + policy_arns = [
          + "arn:aws:iam::aws:policy/AmazonSSMFullAccess",
          + "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          + "arn:aws:iam::aws:policy/CloudWatchFullAccess",
          + (known after apply),
        ]
      + role_name   = "illinois-getchildcare-qa-dashboard-task"
    }

  # module.application.module.dashboard.aws_kms_alias.fargate will be created
  + resource "aws_kms_alias" "fargate" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/illinois-getchildcare/qa/dashboard"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.application.module.dashboard.aws_kms_key.fargate will be created
  + resource "aws_kms_key" "fargate" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "dashboard hosting encryption key for illinois-getchildcare qa"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "Fargate hosting key policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::891377151751:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:Encrypt",
                          + "kms:GenerateDataKey",
                          + "kms:ReEncrypt*",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:CallerAccount"                 = "891377151751"
                              + "kms:EncryptionContext:aws:ecr:arn" = "arn:aws:ecr:us-east-1:891377151751:repository/illinois-getchildcare-qa-dashboard"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow ECR to encrypt container images"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Fargate containers to encrypt objects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "service" = "application-worker"
        }
      + tags_all                           = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
    }

  # module.application.module.worker.aws_iam_policy.secrets will be updated in-place
  ~ resource "aws_iam_policy" "secrets" {
        id               = "arn:aws:iam::891377151751:policy/illinois-getchildcare-qa-worker-secrets-access-20250325215050741400000022"
        name             = "illinois-getchildcare-qa-worker-secrets-access-20250325215050741400000022"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:ssm:us-east-1:891377151751:parameter/illinois-getchildcare/qa/worker/otel",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/aws-20250411174419231600000001-6JBeD1",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/datadog-2025032521495371840000000a-tYZKtn",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/google-20250325214954488100000016-iGNKqR",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/jobrunr-2025032521495433160000000e-ufyDOd",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/mixpanel-20250325214953715400000008-VZb5On",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/sendgrid-20250325214954369500000012-xZap15",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/sentry-20250519183411042900000001-arpo30",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/smarty-2025032521495403730000000c-29jn8F",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-7710bc1d-a336-451e-99eb-039e756902da-9kGuhw",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "service" = "application-worker"
        }
        # (7 unchanged attributes hidden)
    }

  # module.application.module.dashboard.module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "illinois-getchildcare-qa-dashboard"
      + tags     = {
          + "service" = "application-worker"
        }
      + tags_all = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.application.module.dashboard.module.ecs.aws_ecs_cluster_capacity_providers.main[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "illinois-getchildcare-qa-dashboard"
      + id                 = (known after apply)
    }

  # module.application.module.dashboard.module.endpoint_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "illinois-getchildcare-qa-dashboard-endpoint-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "illinois-getchildcare-qa-dashboard-endpoint"
          + "service" = "application-worker"
        }
      + tags_all               = {
          + "Name"        = "illinois-getchildcare-qa-dashboard-endpoint"
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
      + vpc_id                 = "vpc-0d4fbd78717d772f7"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.application.module.dashboard.module.endpoint_security_group.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "10.0.28.0/22",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.application.module.dashboard.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.application.module.dashboard.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.application.module.dashboard.module.otel_config.aws_ssm_parameter.this[0] will be created
  + resource "aws_ssm_parameter" "this" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration for the OpenTelemetry collector."
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = <<-EOT
            extensions:
              health_check:
            
            receivers:
              otlp:
                protocols:
                  grpc:
                    endpoint: 0.0.0.0:4317
                  http:
                    endpoint: 0.0.0.0:4318
              awsxray:
                endpoint: 0.0.0.0:2000
                transport: udp
              statsd:
                endpoint: 0.0.0.0:8125
                aggregation_interval: 60s
              awsecscontainermetrics:
            
            processors:
              batch/traces:
                timeout: 1s
                send_batch_size: 50
              batch/metrics:
                timeout: 60s
              filter:
                metrics:
                  include:
                    match_type: strict
                    metric_names:
                      - ecs.task.memory.reserved
                      - ecs.task.memory.utilized
                      - ecs.task.cpu.reserved
                      - ecs.task.cpu.utilized
                      - ecs.task.network.rate.rx
                      - ecs.task.network.rate.tx
                      - ecs.task.storage.read_bytes
                      - ecs.task.storage.write_bytes
                      - container.duration
              metricstransform:
                transforms:
                  - include: ecs.task.memory.utilized
                    action: update
                    new_name: MemoryUtilized
                  - include: ecs.task.memory.reserved
                    action: update
                    new_name: MemoryReserved
                  - include: ecs.task.cpu.utilized
                    action: update
                    new_name: CpuUtilized
                  - include: ecs.task.cpu.reserved
                    action: update
                    new_name: CpuReserved
                  - include: ecs.task.network.rate.rx
                    action: update
                    new_name: NetworkRxBytes
                  - include: ecs.task.network.rate.tx
                    action: update
                    new_name: NetworkTxBytes
                  - include: ecs.task.storage.read_bytes
                    action: update
                    new_name: StorageReadBytes
                  - include: ecs.task.storage.write_bytes
                    action: update
                    new_name: StorageWriteBytes
            
              resource:
                attributes:
                  - key: ClusterName
                    from_attribute: aws.ecs.cluster.name
                    action: insert
                  - key: aws.ecs.cluster.name
                    action: delete
                  - key: ServiceName
                    from_attribute: aws.ecs.service.name
                    action: insert
                  - key: aws.ecs.service.name
                    action: delete
                  - key: TaskId
                    from_attribute: aws.ecs.task.id
                    action: insert
                  - key: aws.ecs.task.id
                    action: delete
                  - key: TaskDefinitionFamily
                    from_attribute: aws.ecs.task.family
                    action: insert
                  - key: aws.ecs.task.family
                    action: delete
                  - key: TaskARN
                    from_attribute: aws.ecs.task.arn
                    action: insert
                  - key: aws.ecs.task.arn
                    action: delete
                  - key: DockerName
                    from_attribute: aws.ecs.docker.name
                    action: insert
                  - key: aws.ecs.docker.name
                    action: delete
                  - key: TaskDefinitionRevision
                    from_attribute: aws.ecs.task.version
                    action: insert
                  - key: aws.ecs.task.version
                    action: delete
                  - key: PullStartedAt
                    from_attribute: aws.ecs.task.pull_started_at
                    action: insert
                  - key: aws.ecs.task.pull_started_at
                    action: delete
                  - key: PullStoppedAt
                    from_attribute: aws.ecs.task.pull_stopped_at
                    action: insert
                  - key: aws.ecs.task.pull_stopped_at
                    action: delete
                  - key: AvailabilityZone
                    from_attribute: cloud.zone
                    action: insert
                  - key: cloud.zone
                    action: delete
                  - key: LaunchType
                    from_attribute: aws.ecs.task.launch_type
                    action: insert
                  - key: aws.ecs.task.launch_type
                    action: delete
                  - key: Region
                    from_attribute: cloud.region
                    action: insert
                  - key: cloud.region
                    action: delete
                  - key: AccountId
                    from_attribute: cloud.account.id
                    action: insert
                  - key: cloud.account.id
                    action: delete
                  - key: DockerId
                    from_attribute: container.id
                    action: insert
                  - key: container.id
                    action: delete
                  - key: ContainerName
                    from_attribute: container.name
                    action: insert
                  - key: container.name
                    action: delete
                  - key: Image
                    from_attribute: container.image.name
                    action: insert
                  - key: container.image.name
                    action: delete
                  - key: ImageId
                    from_attribute: aws.ecs.container.image.id
                    action: insert
                  - key: aws.ecs.container.image.id
                    action: delete
                  - key: ExitCode
                    from_attribute: aws.ecs.container.exit_code
                    action: insert
                  - key: aws.ecs.container.exit_code
                    action: delete
                  - key: CreatedAt
                    from_attribute: aws.ecs.container.created_at
                    action: insert
                  - key: aws.ecs.container.created_at
                    action: delete
                  - key: StartedAt
                    from_attribute: aws.ecs.container.started_at
                    action: insert
                  - key: aws.ecs.container.started_at
                    action: delete
                  - key: FinishedAt
                    from_attribute: aws.ecs.container.finished_at
                    action: insert
                  - key: aws.ecs.container.finished_at
                    action: delete
                  - key: ImageTag
                    from_attribute: container.image.tag
                    action: insert
                  - key: container.image.tag
                    action: delete
            
            exporters:
              awsxray:
              awsemf/application:
                namespace: "illinois-getchildcare/qa"
                log_group_name: '/aws/ecs/application/metrics'
              awsemf/performance:
                namespace: ECS/ContainerInsights
                log_group_name: '/aws/ecs/containerinsights/{ClusterName}/performance'
                log_stream_name: '{TaskId}'
                resource_to_telemetry_conversion:
                  enabled: true
                dimension_rollup_option: NoDimensionRollup
                metric_declarations:
                  - dimensions: [ [ ClusterName ], [ ClusterName, TaskDefinitionFamily ] ]
                    metric_name_selectors:
                      - MemoryUtilized
                      - MemoryReserved
                      - CpuUtilized
                      - CpuReserved
                      - NetworkRxBytes
                      - NetworkTxBytes
                      - StorageReadBytes
                      - StorageWriteBytes
                  - metric_name_selectors: [container.*]
            
            service:
              pipelines:
                traces:
                  receivers: [otlp,awsxray]
                  processors: [batch/traces]
                  exporters: [awsxray]
                metrics/application:
                  receivers: [otlp, statsd]
                  processors: [batch/metrics]
                  exporters: [awsemf/application]
                metrics/performance:
                  receivers: [awsecscontainermetrics ]
                  processors: [filter, metricstransform, resource]
                  exporters: [ awsemf/performance ]
            
              extensions: [health_check]
        EOT
      + key_id         = (known after apply)
      + name           = "/illinois-getchildcare/qa/dashboard/otel"
      + tags           = {
          + "service" = "application-worker"
        }
      + tags_all       = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
      + tier           = "Intelligent-Tiering"
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.application.module.dashboard.module.task_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "illinois-getchildcare-qa-dashboard-endpoint-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "illinois-getchildcare-qa-dashboard-endpoint"
          + "service" = "application-worker"
        }
      + tags_all               = {
          + "Name"        = "illinois-getchildcare-qa-dashboard-endpoint"
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
      + vpc_id                 = "vpc-0d4fbd78717d772f7"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.application.module.dashboard.module.task_security_group.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.application.module.dashboard.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "dashboard access from the load balancer."
      + from_port                = 8000
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8000
      + type                     = "ingress"
    }

  # module.application.module.dashboard.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be created
  + resource "aws_ecs_service" "main" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + force_delete                       = true
      + health_check_grace_period_seconds  = 300
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "illinois-getchildcare-qa-dashboard"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "service" = "application-worker"
        }
      + tags_all                           = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-07b463c796bfa0584",
              + "subnet-0a57e1462a403f425",
              + "subnet-0d92b7462303b6b91",
            ]
        }
    }

  # module.application.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-qa-app/illinois-getchildcare-qa-app"
        name                               = "illinois-getchildcare-qa-app"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-app:148" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.application.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-qa-worker/illinois-getchildcare-qa-worker"
        name                               = "illinois-getchildcare-qa-worker"
        tags                               = {
            "service" = "application-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-worker:134" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.application.module.dashboard.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = false
      + execution_role_arn       = (known after apply)
      + family                   = "illinois-getchildcare-qa-dashboard"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "service" = "application-worker"
        }
      + tags_all                 = {
          + "environment" = "qa"
          + "project"     = "illinois-getchildcare"
          + "service"     = "application-worker"
          + "tofu"        = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.application.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-app:148" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-app" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  + command           = [
                      + "./scripts/webapp_launcher.sh",
                    ]
                  - mountPoints       = []
                    name              = "illinois-getchildcare-qa-app"
                  ~ portMappings      = [
                      ~ {
                          - hostPort      = 8080
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "otel-collector"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "illinois-getchildcare-qa-app" -> (known after apply)
      ~ revision                 = 148 -> (known after apply)
      - tags                     = {} -> null
        # (11 unchanged attributes hidden)
    }

  # module.application.module.worker.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-worker:134" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-qa-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - command           = [
                      - "./script/worker",
                      - "run",
                    ]
                  - mountPoints       = []
                    name              = "illinois-getchildcare-qa-worker"
                  ~ portMappings      = [
                      ~ {
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  + secrets           = [
                      + {
                          + name      = "ACTIVE_CASELOAD_CODES"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:active_caseload_codes::"
                        },
                      + {
                          + name      = "ADDRESS_VALIDATION_ENABLED"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_address_validation::"
                        },
                      + {
                          + name      = "ALLOW_PDF_MODIFICATION"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:allow_pdf_modification::"
                        },
                      + {
                          + name      = "AWS_ACCESS_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/aws-20250411174419231600000001-6JBeD1:aws_access_key::"
                        },
                      + {
                          + name      = "AWS_BUCKET"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/aws-20250411174419231600000001-6JBeD1:aws_bucket::"
                        },
                      + {
                          + name      = "AWS_REGION"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/aws-20250411174419231600000001-6JBeD1:aws_region::"
                        },
                      + {
                          + name      = "AWS_SECRET_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/aws-20250411174419231600000001-6JBeD1:aws_secret_key::"
                        },
                      + {
                          + name      = "CCMS_API_BASE_URL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:api_base_url::"
                        },
                      + {
                          + name      = "CCMS_API_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:api_password::"
                        },
                      + {
                          + name      = "CCMS_API_USERNAME"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:api_username::"
                        },
                      + {
                          + name      = "CCMS_OFFLINE_TIME_RANGES"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:ccms_offline_time_ranges::"
                        },
                      + {
                          + name      = "CCMS_TRANSACTION_DELAY_MINUTES"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:transaction_delay::"
                        },
                      + {
                          + name      = "CONVERTED_FILE_SUFFIX"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:converted_file_suffix::"
                        },
                      + {
                          + name      = "CONVERT_UPLOADS_TO_PDF"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:convert_uploads_to_pdf::"
                        },
                      + {
                          + name      = "DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-7710bc1d-a336-451e-99eb-039e756902da-9kGuhw:password::"
                        },
                      + {
                          + name      = "DATABASE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-7710bc1d-a336-451e-99eb-039e756902da-9kGuhw:username::"
                        },
                      + {
                          + name      = "DATADOG_API_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/datadog-2025032521495371840000000a-tYZKtn:api_key::"
                        },
                      + {
                          + name      = "DATADOG_APPLICATION_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/datadog-2025032521495371840000000a-tYZKtn:app_key::"
                        },
                      + {
                          + name      = "DATADOG_ENVIRONMENT"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/datadog-2025032521495371840000000a-tYZKtn:environment::"
                        },
                      + {
                          + name      = "DATADOG_RUM_APPLICATION_ID"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/datadog-2025032521495371840000000a-tYZKtn:rum_app_id::"
                        },
                      + {
                          + name      = "DATADOG_RUM_CLIENT_TOKEN"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/datadog-2025032521495371840000000a-tYZKtn:rum_client_token::"
                        },
                      + {
                          + name      = "DATADOG_SESSION_REPLAY_SAMPLE_RATE"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/datadog-2025032521495371840000000a-tYZKtn:session_replay_sample_rate::"
                        },
                      + {
                          + name      = "ENABLE_BACKGROUND_JOBS_FLAG"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/jobrunr-2025032521495433160000000e-ufyDOd:enable_background_jobs::"
                        },
                      + {
                          + name      = "ENABLE_CCMS_INTEGRATION"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:enable_integration::"
                        },
                      + {
                          + name      = "ENABLE_EMAILS_FLAG"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_emails::"
                        },
                      + {
                          + name      = "ENABLE_FASTER_APPLICATION_EXPIRY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_faster_application_expiry::"
                        },
                      + {
                          + name      = "ENABLE_MULTIPLE_PROVIDERS"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_multiple_providers::"
                        },
                      + {
                          + name      = "ENABLE_NEW_SDA_CASELOAD_CODES"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_new_sda_caseload_codes::"
                        },
                      + {
                          + name      = "ENABLE_RESOURCE_ORG_EMAIL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_resource_org_email::"
                        },
                      + {
                          + name      = "ENABLE_SENDGRID_EMAIL_VALIDATION"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:enable_sendgrid_email_validation::"
                        },
                      + {
                          + name      = "ENCRYPTION_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/google-20250325214954488100000016-iGNKqR:encryption_key::"
                        },
                      + {
                          + name      = "JOBRUNR_DASHBOARD_ENABLED"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/jobrunr-2025032521495433160000000e-ufyDOd:dashboard_enabled::"
                        },
                      + {
                          + name      = "MIXPANEL_API_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/mixpanel-20250325214953715400000008-VZb5On:api_key::"
                        },
                      + {
                          + name      = "OCP_APIM_SUBSCRIPTION_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/ccms-20250325214954368200000010-QVK0R3:ocp_apim_key::"
                        },
                      + {
                          + name      = "PENDING_CASELOAD_CODES"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:pending_caseload_codes::"
                        },
                      + {
                          + name      = "RESOURCE_ORG_EMAILS"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:resource_org_emails::"
                        },
                      + {
                          + name      = "SENDGRID_API_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/sendgrid-20250325214954369500000012-xZap15:sendgrid_api_key::"
                        },
                      + {
                          + name      = "SENDGRID_EMAIL_VALIDATION_API_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/sendgrid-20250325214954369500000012-xZap15:sendgrid_email_validation_api_key::"
                        },
                      + {
                          + name      = "SENDGRID_PUBLIC_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/sendgrid-20250325214954369500000012-xZap15:sendgrid_public_key::"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/sentry-20250519183411042900000001-arpo30:dsn::"
                        },
                      + {
                          + name      = "SMARTY_AUTH_ID"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/smarty-2025032521495403730000000c-29jn8F:auth_id::"
                        },
                      + {
                          + name      = "SMARTY_AUTH_TOKEN"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/smarty-2025032521495403730000000c-29jn8F:auth_token::"
                        },
                      + {
                          + name      = "SPRING_PROFILES_ACTIVE"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/qa/il-gcc-application/il-gcc-20250325214954458700000014-nI6BET:spring_profiles_active::"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "otel-collector"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "illinois-getchildcare-qa-worker" -> (known after apply)
      ~ revision                 = 134 -> (known after apply)
        tags                     = {
            "service" = "application-worker"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 23 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```